/*********************************************************************************************************************
* 文件名称          test_key.h
* 功能说明          按键驱动测试程序头文件
* 作者              LittleMaster
* 版本信息          v1.0
* 修改记录
* 日期              作者                版本
* 2025-11-05        LittleMaster       1.0v
********************************************************************************************************************/

#ifndef _TEST_KEY_H_
#define _TEST_KEY_H_

#include "zf_common_typedef.h"

//=================================================函数声明================================================
void test_key_basic(void);              // 基础功能测试
void test_key_event(void);              // 事件检测测试
void test_key_callback(void);           // 回调函数测试
void test_key_all(void);                // 完整测试

#endif // _TEST_KEY_H_

